#ifndef TABLE_H
#define TABLE_H

#include <iostream>
using namespace std;

void printLineForTable()
{
    cout << "+--------------------+---------------+------+--------+---------------+--------------+---------------+---------------+" << endl;
}

void printSpacerLine()
{
    cout << "------------------------------------------------------" << endl;
}

void printHeadForTable()
{
    cout << "+--------------------+---------------+------+--------+---------------+--------------+---------------+---------------+" << endl;
    cout << "|         ФИО        | Дата рождения |Группа|Ср. балл|Сумма стипендии|Год зачисления|   Факультет   | Специальность |" << endl;
    cout << "+--------------------+---------------+------+--------+---------------+--------------+---------------+---------------+" << endl;
}
#endif